Revit 2027 API
Mirror.MirrorColorByObject Property
 The property labeled "Color By Object" from the "Mirror" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MirrorColorByObject { get; }
Public Shared ReadOnly Property MirrorColorByObject As String
	Get
public:
static property String^ MirrorColorByObject {
	String^ get ();
}
static member MirrorColorByObject : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
Mirror Class
Autodesk.Revit.DB.Visual Namespace